In [1]:
import pandas as pd
from pandas import DataFrame

In [2]:
data = {
    "city" : ["Paris", "Paris", "Paris", "Paris",
             "London", "London", "London", "London",
             "Rome", "Rome", "Rome", "Rome"],
    "year" : [2001, 2002, 2003, 2004,
             2001, 2006, 2007, 2008,
             2001, 2010, 2011, 2012],
    "pop" : [2.123, 2.321, 12.123, 4.123,
            9.00, 9.978, 7.678, 9.876,
            2.123, 3.413, 5.231, 5.152]}

In [3]:
census = DataFrame(data)

In [4]:
census

      city  year     pop
0    Paris  2001   2.123
1    Paris  2002   2.321
2    Paris  2003  12.123
3    Paris  2004   4.123
4   London  2001   9.000
5   London  2006   9.978
6   London  2007   7.678
7   London  2008   9.876
8     Rome  2001   2.123
9     Rome  2010   3.413
10    Rome  2011   5.231
11    Rome  2012   5.152

In [5]:
#Get head and tail of table
census.head(5)

     city  year     pop
0   Paris  2001   2.123
1   Paris  2002   2.321
2   Paris  2003  12.123
3   Paris  2004   4.123
4  London  2001   9.000

In [6]:
#Get head and tail of table
census.tail(3)

    city  year    pop
9   Rome  2010  3.413
10  Rome  2011  5.231
11  Rome  2012  5.152

In [7]:
census["city"]

0      Paris
1      Paris
2      Paris
3      Paris
4     London
5     London
6     London
7     London
8       Rome
9       Rome
10      Rome
11      Rome
Name: city, dtype: object

NOTE: **Series Selects by Row and DataFrame selects by Column**

In [8]:
type(census["city"])

pandas.core.series.Series

In [9]:
census["city"] == "Paris"

0      True
1      True
2      True
3      True
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
Name: city, dtype: bool

In [10]:
census[  census["city"] == "Paris"  ]

    city  year     pop
0  Paris  2001   2.123
1  Paris  2002   2.321
2  Paris  2003  12.123
3  Paris  2004   4.123

In [11]:
#Querying data in DataFrame by Index (loc means location)
census.loc[3]

city    Paris
year     2004
pop     4.123
Name: 3, dtype: object

In [12]:
#Adding column to dataframe
census["continental"] =    census["city"] != "London"

In [13]:
census

      city  year     pop  continental
0    Paris  2001   2.123         True
1    Paris  2002   2.321         True
2    Paris  2003  12.123         True
3    Paris  2004   4.123         True
4   London  2001   9.000        False
5   London  2006   9.978        False
6   London  2007   7.678        False
7   London  2008   9.876        False
8     Rome  2001   2.123         True
9     Rome  2010   3.413         True
10    Rome  2011   5.231         True
11    Rome  2012   5.152         True

In [14]:
#Deleting column from dataframe
del census["continental"]

In [15]:
census

      city  year     pop
0    Paris  2001   2.123
1    Paris  2002   2.321
2    Paris  2003  12.123
3    Paris  2004   4.123
4   London  2001   9.000
5   London  2006   9.978
6   London  2007   7.678
7   London  2008   9.876
8     Rome  2001   2.123
9     Rome  2010   3.413
10    Rome  2011   5.231
11    Rome  2012   5.152

# Exercise 1:
**Select data from year 2001, which city had the lowest pop that year**

In [25]:
mydata = census[   census["year"] ==  2001   ][  "pop"  ]
mydata

0    2.123
4    9.000
8    2.123
Name: pop, dtype: float64

In [27]:
mydata.min()

2.123

In [28]:
mydata.idxmin() #returns the index of minimum value

0

In [29]:
census[ "city" ][mydata.idxmin()]

'Paris'

In [32]:
#OR
census[ "city" ][ census[census["year"] == 2001]["pop"].idxmin()]

'Paris'